In [1]:
import sqlite3
conn = sqlite3.connect('database.sqlite')

In [2]:
conn.execute(
    """
  CREATE TABLE IF NOT EXISTS yearly_data (
    work_year INTEGER,
    experience_level TEXT,
    employment_type TEXT,
    job_title TEXT,
    salary INTEGER,
    salary_currency TEXT,
    salary_in_usd INTEGER,
    employee_residence TEXT,
    remote_ratio INTEGER,
    company_location TEXT,
    company_size TEXT
  );
"""
)

In [3]:
import pandas as pd
file = './salaries.csv'
df = pd.read_csv(file)
df.to_sql('yearly_data', conn, if_exists='replace', index=False)

16494

In [4]:
conn.execute(
    """CREATE TABLE IF NOT EXISTS MAIN_TABLE (
        Year INTEGER PRIMARY KEY, 
        No_Total_Jobs INTEGER, 
        Average_salary_in_USD REAL
    )"""
)

In [5]:
query = """
    INSERT INTO MAIN_TABLE (Year, No_Total_Jobs, Average_salary_in_USD)
    SELECT
      work_year AS Year,
      COUNT(*) AS No_Total_Jobs,
      AVG(salary_in_usd) AS Average_salary_in_USD
    FROM yearly_data
    GROUP BY work_year
"""
conn.execute(query)

In [6]:
query = "SELECT * FROM MAIN_TABLE"
pd.read_sql(query, conn)

   Year  No_Total_Jobs  Average_salary_in_USD
0  2020             75          102250.866667
1  2021            218           99922.073394
2  2022           1655          134349.500906
3  2023           8519          153732.664632
4  2024           6027          150643.254853

In [7]:
conn.commit()

In [8]:
query = """CREATE TABLE IF NOT EXISTS Data_2020(
       Job_title TEXT,
       No_Of_Jobs INTEGER
)"""
conn.execute(query)

In [10]:
query = """
    INSERT INTO Data_2020 (Job_title, No_Of_Jobs)
    SELECT job_title, COUNT(*) as No_Of_Jobs
    FROM yearly_data
    WHERE work_year = 2020
    GROUP BY job_title
"""
conn.execute(query)

In [26]:
query = "SELECT * FROM Data_2022"
pd.read_sql(query, conn)

                                   Job_title  No_Of_Jobs
0                               AI Scientist           3
1                     Applied Data Scientist           2
2         Applied Machine Learning Scientist           2
3              Autonomous Vehicle Technician           1
4                            BI Data Analyst           4
5                         Big Data Architect           1
6                          Big Data Engineer           4
7                      Business Data Analyst           2
8                       Cloud Data Architect           1
9                        Cloud Data Engineer           2
10                  Computer Vision Engineer           3
11         Computer Vision Software Engineer           3
12                              Data Analyst          20
13                   Data Analytics Engineer           3
14                    Data Analytics Manager           3
15                            Data Architect           3
16                             Data Engineer          37
17                   Data Science Consultant           5
18                     Data Science Engineer           2
19                         Data Science Lead           1
20                      Data Science Manager           6
21                            Data Scientist          40
22                           Data Specialist           1
23                  Director of Data Science           5
24                      Finance Data Analyst           1
25                              Head of Data           3
26                      Head of Data Science           2
27                         Lead Data Analyst           2
28                        Lead Data Engineer           3
29                       Lead Data Scientist           1
30                               ML Engineer           4
31                Machine Learning Developer           3
32                 Machine Learning Engineer          18
33  Machine Learning Infrastructure Engineer           1
34        Machine Learning Research Engineer           1
35                Machine Learning Scientist           3
36                    Marketing Data Analyst           1
37                   Marketing Data Engineer           1
38                    Principal Data Analyst           1
39                   Principal Data Engineer           2
40                  Principal Data Scientist           5
41                        Research Scientist          10
42                      Staff Data Scientist           1
43           Staff Machine Learning Engineer           1

In [12]:
query = """CREATE TABLE IF NOT EXISTS Data_2021(
       Job_title TEXT,
       No_Of_Jobs INTEGER
)"""
conn.execute(query)

In [13]:
query = """
    INSERT INTO Data_2021 (Job_title, No_Of_Jobs)
    SELECT job_title, COUNT(*) as No_Of_Jobs
    FROM yearly_data
    WHERE work_year = 2021
    GROUP BY job_title
"""
conn.execute(query)

In [14]:
query = """CREATE TABLE IF NOT EXISTS Data_2022(
       Job_title TEXT,
       No_Of_Jobs INTEGER
)"""
conn.execute(query)

In [15]:
query = """
    INSERT INTO Data_2022 (Job_title, No_Of_Jobs)
    SELECT job_title, COUNT(*) as No_Of_Jobs
    FROM yearly_data
    WHERE work_year = 2022
    GROUP BY job_title
"""
conn.execute(query)

In [16]:
query = """CREATE TABLE IF NOT EXISTS Data_2023(
       Job_title TEXT,
       No_Of_Jobs INTEGER
)"""
conn.execute(query)

In [17]:
query = """
    INSERT INTO Data_2023 (Job_title, No_Of_Jobs)
    SELECT job_title, COUNT(*) as No_Of_Jobs
    FROM yearly_data
    WHERE work_year = 2023
    GROUP BY job_title
"""
conn.execute(query)

In [18]:
query = """CREATE TABLE IF NOT EXISTS Data_2024(
       Job_title TEXT,
       No_Of_Jobs INTEGER
)"""
conn.execute(query)

In [19]:
query = """
    INSERT INTO Data_2024 (Job_title, No_Of_Jobs)
    SELECT job_title, COUNT(*) as No_Of_Jobs
    FROM yearly_data
    WHERE work_year = 2024
    GROUP BY job_title
"""
conn.execute(query)

In [20]:
conn.commit()